Repository: wangyiwei2015/Shortcuts-Maths
Catalog: shortcuts-maths/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Clamped
zh_hans: 截断结果

source: Clamps the vector.
zh_hans: 饱和截断向量。

source: Create a Nx1 vector.
zh_hans: 创建一个 Nx1 向量

source: Create a vector with input List.
zh_hans: 从输入的数字列表构建Vector向量

source: Create Vector from ${list}
zh_hans: 从${list}构建向量

source: Debug Description
zh_hans: 调试信息

source: Dot Result
zh_hans: 内积结果

source: Element List
zh_hans: 所有元素作为列表

source: Empty
zh_hans: 空向量

source: FFT Result
zh_hans: FFT结果

source: Fill with Constant
zh_hans: 填充补齐

source: Filling
zh_hans: 填充值

source: If Dimensions Mismatch
zh_hans: 当维度不一致时

source: Input List
zh_hans: 列表输入

source: Inverse the vector.
zh_hans: 计算逆向量

source: Inversed
zh_hans: 逆向量

source: Lower Limit
zh_hans: 下限

source: Mismatch Strategy
zh_hans: 维度不一致操作

source: Normalize ${vector}
zh_hans: 归一化 ${vector}

source: Normalize the vector.
zh_hans: 归一化向量

source: Normalized
zh_hans: 归一化向量

source: Operation
zh_hans: 算符

source: RMS
zh_hans: 均方根

source: RMS of ${vector}
zh_hans: ${vector}的均方根RMS值

source: Scalar
zh_hans: 标量

source: Scalar Result
zh_hans: 乘积结果

source: Throw Error
zh_hans: 抛出错误

source: Truncate to Shorter
zh_hans: 自动截取

source: Upper Limit
zh_hans: 上限

source: Vector (%lld elements)
zh_hans: 向量 (%lld 个值)

source: Vector literal
zh_hans: 字面量

source: Vector: Correlation
zh_hans: Vector: 相关

source: Vector: Create from List
zh_hans: Vector: 从列表转换

source: Vector: Create literal
zh_hans: Vector: 字面量创建

source: Vector: Debug description
zh_hans: Vector: Debug输出

source: Vector: Dot Product
zh_hans: Vector: 计算内积

source: Vector: Element-wise abs
zh_hans: Vector: 按元素取绝对值

source: Vector: Element-wise Compute
zh_hans: Vector: 按元素四则运算

source: Vector: FFT Magnitude
zh_hans: Vector: 傅里叶变换

source: Vector: Inverse
zh_hans: Vector: 逆矩阵

source: Vector: Magnitude (Euclidean Norm)
zh_hans: Vector: 模长

source: Vector: Normalize
zh_hans: Vector: 归一化

source: Vector: Root Mean Square
zh_hans: Vector: 求均方根RMS

source: Vector: Scalar Multiply
zh_hans: Vector: 标量倍乘

source: Vector: Threshold / Clamp
zh_hans: Vector: 饱和截断
